{
  "url": "https://www.npmjs.com/package/report-builder",
  "name": "report-builder",
  "badge": "<a href=\"https://www.npmjs.com/package/report-builder\"><img src=\"https://img.shields.io/npm/v/report-builder.svg?style=flat-square\" alt=\"NPM\" class=\"badge\"></a>\n<a href=\"https://david-dm.org/danielo515/report-builder\"><img src=\"https://img.shields.io/david/danielo515/report-builder.svg?style=flat-square\" alt=\"David\" class=\"badge\"></a>\n<a href=\"https://travis-ci.org/danielo515/report-builder\"><img src=\"https://img.shields.io/travis/danielo515/report-builder/master.svg?style=flat-square\" alt=\"Travis\" class=\"badge\"></a>\n<a href=\"https://coveralls.io/r/danielo515/report-builder?branch=master\"><img src=\"https://coveralls.io/repos/danielo515/report-builder/badge.svg?branch=master\" alt=\"Coverage Status\" class=\"badge\"></a>",
  "description": [
    "A simple tool for helping your programs generate complex JSON documents.\nIt provides a nice developer experience providing simple but powerful chainable methods.",
    "Create complex JSON reports easily",
    "Install via yarn",
    "or npm",
    "If you don't use a package manager, you can access report-builder via unpkg (CDN), download the source, or point your package manager to the url.",
    "report-builder is compiled as a collection of CommonJS modules & ES2015 modules for bundlers that support the jsnext:main or module field in package.json (Rollup, Webpack 2)",
    "The report-builder package includes precompiled production and development UMD builds in the dist folder. They can be used directly without a bundler and are thus compatible with many popular JavaScript module loaders and environments. You can drop a UMD build as a <script> tag on your page. The UMD builds make report-builder available as a window.reportBuilder global variable.",
    "See example folder or the runkit example.",
    "You have to require the report constructor, then you instantiate a report, and then you can start using it:",
    "Each call to .section('name') will return a section object pointing to that area of the report.\nYou can save this reference and use it later, for example:",
    "After running all that example code, we can generate a JSON representation of our report\nusing JSON.stringify. Let's output it to the console:",
    "A report in it's simpler has a summary and a results sections.\nCheck the format below:",
    "The code is available under the MIT license.",
    "We are open to contributions, see CONTRIBUTING.md for more info.",
    "For a more complete description of the api please check the documentation",
    "This module was created using generator-module-boilerplate.",
    "This is a work in progress, and may be a bit oppinionated. It was build to suit my needs, so it makes sense."
  ]
}